# Koşullu Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     3     6     5
1    14    24    10
2    19    12    22
3     8     1    18
4     5    29     6
5     8    29    17
6    22    24    20
7     8     7    15
8    15    13    16
9     6    10    28

In [2]:
df["var1"]

0     3
1    14
2    19
3     8
4     5
5     8
6    22
7     8
8    15
9     6
Name: var1, dtype: int32

In [3]:
df[0:2][["var1","var3"]]

   var1  var3
0     3     5
1    14    10

In [4]:
df

   var1  var2  var3
0     3     6     5
1    14    24    10
2    19    12    22
3     8     1    18
4     5    29     6
5     8    29    17
6    22    24    20
7     8     7    15
8    15    13    16
9     6    10    28

In [5]:
df.var1

0     3
1    14
2    19
3     8
4     5
5     8
6    22
7     8
8    15
9     6
Name: var1, dtype: int32

In [6]:
df[df.var1 > 15]

   var1  var2  var3
2    19    12    22
6    22    24    20

In [7]:
df[(df.var1 > 15) & (df.var3 < 5)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [8]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
2    19    12
6    22    24

In [9]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
2    19    12
6    22    24